window.onload=function(){
	function fillDesc(cls, text) {
		var item = document.getElementById(cls);
		if (item)
			item.innerHTML = text;
	}
	fillDesc("descrOLAP", "text for olap<br/>文件系统是操作系统用于明确存储设备（常见的是磁盘，也有基于NAND Flash的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出、修改、转储文件，控制文件的存取，当用户不再使用时撤销文件等。");
	fillDesc("descrDFS", "text for desc<br/>文件系统是操作系统用于明确存储设备（常见的是磁盘，也有基于NAND Flash的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出、修改、转储文件，控制文件的存取，当用户不再使用时撤销文件等。");
	fillDesc("descrLLTS", "text for llts<br/>文件系统是操作系统用于明确存储设备（常见的是磁盘，也有基于NAND Flash的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出、修改、转储文件，控制文件的存取，当用户不再使用时撤销文件等。");
	fillDesc("descrHBASE", "text for hbase<br/>文件系统是操作系统用于明确存储设备（常见的是磁盘，也有基于NAND Flash的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出、修改、转储文件，控制文件的存取，当用户不再使用时撤销文件等。");
	fillDesc("descrSTORM", "text for storm<br/>文件系统是操作系统用于明确存储设备（常见的是磁盘，也有基于NAND Flash的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出的固态硬对象及属性。从系统角度来看，文件系统是对文件存储设备的空间进行组织和分配=文件，存入、读出、修改、转储文件，控制文件的存取，当用户不再使用时撤销文件等。");
}